#include <iostream>
using namespace std;
/*
. Si a=5, b=5, c=40, d=10, e=20. Determinar si las siguientes expresiones dan como 
resultado falso (F) o verdadero (V): 
1) (𝑎 ∗ 𝑏) + (𝑐 / 𝑑) > 𝑒 
2) 𝑜(𝑎 ≥ 𝑐 − (𝑑 ∗ 𝑒)) 𝑦 (𝑏 < 𝑎)  
3) ((𝑑 + 𝑒) / 𝑎) < (𝑐 − 𝑏) 𝑦 𝑛𝑜(𝑎 == 10)  
4) (𝑒 − 𝑏) ∗ (𝑐 / 𝑑) ≥ 𝑎 𝑦 (𝑏 + 𝑐) > 𝑒  
5) 𝑜((𝑎 ∗ 𝑏) == (𝑐 − 𝑑)) 𝑜 (𝑒 ≤ (𝑐 + 𝑏))  
6) (𝑎 + (𝑐 / 𝑑)) < (𝑒 + 𝑏) 𝑦 𝑛𝑜(𝑒 ≥ 𝑑)  
7) (𝑐 > 𝑎 ∗ 𝑏) 𝑦 (𝑑 < 𝑒) 𝑜 𝑛𝑜(𝑎 == 10)
8) 𝑜((𝑐 / 𝑑) + (𝑎 − 𝑏) ≥ 𝑒) 𝑜 (𝑏 ∗ 𝑑) < (𝑎 + 𝑐)  
9) (𝑎 + 𝑏) ∗ (𝑐 / 𝑒) < 𝑑 𝑜 𝑛𝑜(𝑐 < 𝑒 + 𝑏)  
10) (𝑑 − 𝑎) ∗ (𝑒 / 𝑏) > 𝑐 𝑦 𝑛𝑜((𝑐 ≤ 𝑎) 𝑜 (𝑏 > 𝑑))  
11) (𝑑 − 𝑎) ∗ (𝑒 / 𝑏) > 𝑐 𝑦 𝑛𝑜(𝑛𝑜((𝑐 ≤ 𝑎) 𝑜 (𝑏 > 𝑑)))  
12) (𝑐 > 𝑎 ∗ 𝑏) 𝑦 (𝑑 < 𝑒) 𝑜 𝑛𝑜(𝑛𝑜(𝑎 == 10))  
13) 𝑜(𝑛𝑜((𝑐 / 𝑑) + (𝑎 − 𝑏) ≥ 𝑒)) 𝑜 (𝑏 ∗ 𝑑) < (𝑎 + 𝑐)  
*/
int main() {
    int a=5, b=5, c=40, d=10, e=20;
    cout << "1 = Verdadero, 0 = Falso" << endl;
    cout << "1) " << (((a*b) + (c/d) > e)) << endl;
    cout << "2) " << ((a >= c - (d*e)) && (b < a)) << endl;
    cout << "3) " << (((d+e)/a) < (c-b) && !(a==10)) << endl;
    cout << "4) " << ((e-b)*(c/d) >= a && (b+c) > e) << endl;
    cout << "5) " << (((a*b) == (c-d)) || (e <= (c+b))) << endl;
    cout << "6) " << ((a+(c/d)) < (e+b) && !(e>=d)) << endl;
    cout << "7) " << ((c>a*b) && (d<e) || !(a==10)) << endl;
    cout << "8) " << (((c/d) + (a-b) >= e) || (b*d) < (a+c)) << endl;
    cout << "9) " << ((a+b)*(c/e) < d || !(c<e+b)) << endl;
    cout << "10) " << ((d-a)*(e/b) > c && !(c<=a || b>d)) << endl;
    cout << "11) " << ((d-a)*(e/b) > c && !(!(c<=a || b>d))) << endl;
    cout << "12) " << ((c>a*b) && (d<e) || !(!(a==10))) << endl;
    cout << "13) " << ((!(c/d) + (a-b) >= e) || (b*d) < (a+c)) << endl;
    return 0;
}